// ConsoleApplication1.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
    int n = 0;
    bool a, b, c, d, e;
    do {
        
        do {
            std::cout << "请输入正整数n(1000<n<9999)" << std::endl;
            std::cout << "n=";
            std::cin >> n;



            if (n <= 1000 || n >= 9999)
            {
                std::cout << "n的值不在给定范围之内，请重新输入！" << std::endl;
                n = 0;
            }


        } while (n == 0);
        a = (n % 7 == 0);
        b = (n % 10 ==7);
        c = (n % 100 / 10==7);
        d =( n % 1000 / 100 ==7);
        e = n / 1000 % 7 ==7;
        if (a || b  ||  c || d || e  )
        {
            std::cout << "yes" << std::endl;
        }
        else
        {
            std::cout << "no" << std::endl;
        }
    } while (true);
    system("PAUSE");
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
